// pages/map/firend/firend.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    menuList:[
      {
        name:'入学年份',
        list:['2010','2011','2012','2013','2014']
      },
      {
        name:'专业',
        list:['油气储运工程','能源与动力工程','轮机工程']
      },
      {
        name:'班级',
        list:['20100102','20100103','20100102','20100102','20100102','20100103','20100102','20100102']
      },
      {
        name:'所在地',
        list:[
          {
            province:'湖北省',
            city:'武汉市',
            district:'洪山区'
          }
        ]
      },
      {
        name:'状态',
        list:['升学','就业','升学就业']
      },
      {
        name:'单位性质',
        list:['外资','合资','国企','民营公司','上市公司','创业公司','外企代表处','政府机关','事业单位']
      },
      {
        name:'所在行业',
        list:['计算机/网路/通讯/电子','会计/金融/银行/保险','贸易/消费/制造/营运','广告/媒体','广告/媒体']
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})